{
  "users": [
    {
      "username": "ahmetmb",
      "password": "12345",
      "name": "Ahmet Muhiddin",
      "surname": "Bilgin",
      "email": "ahmet.m.bilgin@hotmail.com",
      "id": 1
    },
    {
      "username": "furkan34",
      "password": "34",
      "name": "furkan",
      "surname": "telli",
      "email": "ftelli@yahoo.com",
      "id": 2
    }
  ],
  "foods": [],
  "coffees": [
    {
      "title": "Türk Kahvesi",
      "type": "coffees",
      "description": "Kahveyi (ve eklediyseniz şekeri) su ile iyice ıslanacak ve çözünecek şekilde karıştırın. Cezveyi kısık ateşte üzerinde köpük oluşuncaya kadar kaynama derecesine yaklaşmasını gözleyin. Kaynamaya başlamadan önce kısık ateşten alarak üst tabakada kabaran kahve köpüğünü fincanlara eşit miktarda pay edin.",
      "url": "https://i4.hurimg.com/i/hurriyet/75/750x0/5fca383fc9de3d05fc0dfd62.jpg",
      "userID": 2,
      "id": 1
    }
  ],
  "snacks": [
    {
      "title": "Fırında Falafel",
      "type": "snacks",
      "description": "Haşlanmış nohutları, zeytinyağını, baharatları, kuru soğanı ve sarımsağı el blenderi ile püre haline getirin. İçine ince doğranmış maydanoz, galeta unu ve yumurtayı da ekleyin ve güzelce yoğurun. Hazırladığınız harçtan cevizden biraz daha irice parçalar kopartın elinizle yuvarlayın. Hafifçe yassılaştırıp yağlı kâğıt serilmiş bir fırın tepsisine dizin. Önceden ısıtılmış 180 derece fırında üstleri hafifçe kızarana dek, kontrolü olarak yaklaşık 25 dakika kadar pişirin. Fırından aldıktan sonra ılık ılık servis edin.  Afiyetler olsun!",
      "url": "https://cdn.yemek.com/mnresize/1250/833/uploads/2016/08/firinda-falafel-one-cikan.jpg",
      "userID": 1,
      "id": 1
    },
    {
      "title": "Patates Kroket",
      "type": "snacks",
      "description": "Patatesleri güzelce yıkayıp haşlayın. Haşlanan patatesleri sıcak sıcak ezin. Püre haline gelen patateslerin içine tereyağını ve 2 adet yumurta sarısını ilave edip karıştırın. Pürüzsüz bir kıvam alınca nişasta ve baharatları ekleyip karıştırın. Püreyi sıkma torbasına alın. Kesme tahtasını streçle kaplayın. Üzerine püreyi şeritler halinde sıkın. Harcın dinlenip kıvam alması için 1 saat kadar dondurucuda bekletin. Dondurucudan aldıktan sonra istenilen büyüklükte şeritler kesin. Her bir parçayı önce una sonra yumurtaya ve galeta ununa bulayın. Dışının daha çıtır olması için tekrar yumurta ve galeta ununa bulayın. Kızdırılmış yağda kızartın. Yanına soslarla servis edebilirsiniz. Afiyet olsun. ",
      "url": "https://cdn.yemek.com/mnresize/1250/833/uploads/2014/06/patates-kroket-one-cikan.jpg",
      "userID": 2,
      "id": 2
    }
  ]
}